app/views/posts/index.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
---
<div>These are all the posts for <%=@user.fname%> <%=@user.lname%>: </h1>
<% @user.posts.each do|post| %>