app/controllers/posts_controller.rb

	def index
		@user_id = params[:user_id]
		@user = User.find(@user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]