app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---
	def show
		puts "Showing user/:id action"
		@user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
---
	def destroy
		puts "Delete action requested"
		@user = User.find(params[:id])