HW/app/views/users/destroy.html.erb

@name = @user.fname
@user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]